In [39]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [55]:
test = pa.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')
test[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
1,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
2,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
3,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
4,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"
...,...,...,...,...,...,...
555,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
556,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
557,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
558,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
559,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

TypeError: list indices must be integers or slices, not list

In [27]:
labels = ['a','b','c','d']
my_list = [10,20,30,40]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [28]:
pd.Series(data=my_list, index=labels)

a    10
b    20
c    30
d    40
dtype: int64

In [31]:
ser1 = pd.Series(my_list, index=['USA', 'Germany', 'Poland', 'Japan'])

In [32]:
ser1

USA        10
Germany    20
Poland     30
Japan      40
dtype: int64

In [36]:
ser2 = pd.Series([1,2,3,4], index=['USA', 'Germany', 'Poland', 'Italy'])

In [37]:
ser2

USA        1
Germany    2
Poland     3
Italy      4
dtype: int64

In [38]:
ser1 + ser2

Germany    22.0
Italy       NaN
Japan       NaN
Poland     33.0
USA        11.0
dtype: float64

In [40]:
df1 = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [42]:
df1

          W         X         Y         Z
A -1.764888 -0.959735 -0.621356 -0.610490
B -2.302488 -0.882243  0.061138 -0.964515
C  0.106827 -0.563191 -1.116867 -1.095084
D -1.013630 -1.416690 -0.716775 -1.395475
E -0.564507 -1.272179 -0.828833 -0.915672

In [43]:
df2 = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'F'])

In [44]:
df2

          0         1         2         3
A  1.073088  1.072057  0.019737 -2.073973
B  0.715380 -0.620473 -1.656989  0.370820
C  0.123044  0.923993  1.129031 -2.551000
D -0.432045  0.418477 -0.583089 -0.084649
F  0.101272  0.435393  0.378206 -0.540558

In [46]:
df2[0]

A    1.073088
B    0.715380
C    0.123044
D   -0.432045
F    0.101272
Name: 0, dtype: float64

In [59]:
df1[['W','Z']]

          W         Z
A -1.764888 -0.610490
B -2.302488 -0.964515
C  0.106827 -1.095084
D -1.013630 -1.395475
E -0.564507 -0.915672

In [72]:
df1['New'] = df1['W'] + df1['Y']

In [61]:
df1

          W         X         Y         Z       New
A -1.764888 -0.959735 -0.621356 -0.610490 -2.386244
B -2.302488 -0.882243  0.061138 -0.964515 -2.241350
C  0.106827 -0.563191 -1.116867 -1.095084 -1.010040
D -1.013630 -1.416690 -0.716775 -1.395475 -1.730405
E -0.564507 -1.272179 -0.828833 -0.915672 -1.393340

In [63]:
df1.drop('New',axis=1)

          W         X         Y         Z
A -1.764888 -0.959735 -0.621356 -0.610490
B -2.302488 -0.882243  0.061138 -0.964515
C  0.106827 -0.563191 -1.116867 -1.095084
D -1.013630 -1.416690 -0.716775 -1.395475
E -0.564507 -1.272179 -0.828833 -0.915672

In [71]:
df1

          W         X         Y         Z
A -1.764888 -0.959735 -0.621356 -0.610490
B -2.302488 -0.882243  0.061138 -0.964515
C  0.106827 -0.563191 -1.116867 -1.095084
D -1.013630 -1.416690 -0.716775 -1.395475
E -0.564507 -1.272179 -0.828833 -0.915672

In [75]:
df1.drop('New', axis=1, inplace=True)
df1

          W         X         Y         Z
A -1.764888 -0.959735 -0.621356 -0.610490
B -2.302488 -0.882243  0.061138 -0.964515
C  0.106827 -0.563191 -1.116867 -1.095084
D -1.013630 -1.416690 -0.716775 -1.395475
E -0.564507 -1.272179 -0.828833 -0.915672

In [76]:
df1.drop('E',axis=0)

          W         X         Y         Z
A -1.764888 -0.959735 -0.621356 -0.610490
B -2.302488 -0.882243  0.061138 -0.964515
C  0.106827 -0.563191 -1.116867 -1.095084
D -1.013630 -1.416690 -0.716775 -1.395475

In [77]:
df1.loc['A']

W   -1.764888
X   -0.959735
Y   -0.621356
Z   -0.610490
Name: A, dtype: float64

In [79]:
df1.iloc[2]

W    0.106827
X   -0.563191
Y   -1.116867
Z   -1.095084
Name: C, dtype: float64

In [81]:
df1<0

       W     X      Y     Z
A   True  True   True  True
B   True  True  False  True
C  False  True   True  True
D   True  True   True  True
E   True  True   True  True

In [84]:
df1[df1<0]

          W         X         Y         Z
A -1.764888 -0.959735 -0.621356 -0.610490
B -2.302488 -0.882243       NaN -0.964515
C       NaN -0.563191 -1.116867 -1.095084
D -1.013630 -1.416690 -0.716775 -1.395475
E -0.564507 -1.272179 -0.828833 -0.915672

In [86]:
df1[(df1['W']<0) & (df1['Y'] < 1)]

          W         X         Y         Z
A -1.764888 -0.959735 -0.621356 -0.610490
B -2.302488 -0.882243  0.061138 -0.964515
D -1.013630 -1.416690 -0.716775 -1.395475
E -0.564507 -1.272179 -0.828833 -0.915672

In [91]:
df1.reset_index()

  index         W         X         Y         Z
0     A -1.764888 -0.959735 -0.621356 -0.610490
1     B -2.302488 -0.882243  0.061138 -0.964515
2     C  0.106827 -0.563191 -1.116867 -1.095084
3     D -1.013630 -1.416690 -0.716775 -1.395475
4     E -0.564507 -1.272179 -0.828833 -0.915672

In [95]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [96]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [97]:
df = pd.DataFrame(np.random.rand(6,2), index=hier_index,columns=['A','B'])

In [98]:
df

             A         B
G1 1  0.556218  0.135855
   2  0.337633  0.248418
   3  0.765360  0.425989
G2 1  0.079922  0.008635
   2  0.845377  0.411844
   3  0.394440  0.156279

In [99]:
df.loc['G1']

          A         B
1  0.556218  0.135855
2  0.337633  0.248418
3  0.765360  0.425989

In [100]:
df.index.name = ['Group', 'Num']

In [101]:
df

             A         B
G1 1  0.556218  0.135855
   2  0.337633  0.248418
   3  0.765360  0.425989
G2 1  0.079922  0.008635
   2  0.845377  0.411844
   3  0.394440  0.156279

In [102]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [103]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [110]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [114]:
df.dropna(thresh=0)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [118]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [120]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [122]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [129]:
by_comp = df.groupby('Company')
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [131]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [133]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [136]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [137]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [138]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [139]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [141]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [142]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [147]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [148]:
pd.merge(left,right,on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [149]:
pd.merge(left,right,how='outer', on = ['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [150]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [151]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [152]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [153]:
left.join(right, how = 'outer')

ValueError: columns overlap but no suffix specified: Index(['A', 'B'], dtype='object')

In [2]:
'Mike'>'Mikey'

False

In [3]:
print(ord('c')-ord('a'))

2

In [5]:
print(float("1,3"))

ValueError: could not convert string to float: '1,3'

In [6]:
print(chr(ord('z')-2))

x

In [7]:
print(3*'abc'+'xyz')

abcabcabcxyz

In [8]:
from a.b import c

ModuleNotFoundError: No module named 'a'

In [9]:
x = '\'' print(len(x))

SyntaxError: invalid syntax (<ipython-input-9-adcfb7abc25c>, line 1)

In [10]:
assert var == 0

NameError: name 'var' is not defined